Actividad-ES/app/controllers/movies_controller.rb

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]
---
  def show_by_director
    @movie = Movie.find params[:id]